package HomeWork_09;

public class HomeWork_9_2 {

    public static void main(String[] args) {
        /*
        Дан массив строк. Вывести на экран все символы из самой длинной строки массива
         */
        String[] strings = new String[7];

        String[] strings1 = {"Montag", "Dienstag", "Mitwoch", "Donnerstag", "Freitag", "Samstag", "Sontag"};


        System.out.println(strings1[0].length());


    }
}
