import java.util.Random;

public class ArandzinXndirner {
    /*
    Создать программу, которая будет сообщать, является ли целое число, введённое пользователем, чётным или нет.
Ввод числа осуществлять с помощью класса Scanner.
Если пользователь введёт не целое число, то сообщать ему об ошибке.
Решение на Patreon.
     */
    public static void main(String[] args) {
//        int x = 0;
//        Scanner scanner = new Scanner(System.in);
//        System.out.println("please push number");
//        x = scanner.nextInt();

//        if (x % 2 ==0){
//            System.out.println("vasha cheslo chyotnoe");

//        }else {
//           System.out.println("vi velli ne korektnoe cheslo");
//        }

        /*
        Создать программу, которая будет выводить на экран меньшее по модулю из трёх введённых пользователем вещественных чисел.
        Для вычисления модуля используйте тернарную условную операцию.
        Для ввода чисел используем класс Scanner.
        Решение на Patreon
         */

//        double y = 0;
//        double z = 0;
//        double t = 0;
//        Scanner scanner1 = new Scanner(System.in);
//        Scanner scanner2 = new Scanner(System.in);
//        Scanner scanner3 = new Scanner(System.in);
//        System.out.println("vvedite cheslo");
//        y = scanner1.nextInt();
//        z = scanner2.nextInt();
//        t = scanner3.nextInt();

//        if (y <= 0 || z <= 0 || t <= 0) {
//            System.out.println("vi veli nepravilnoe cheslo");
//        }

//        if (y < z && y < t){
//            System.out.println(y);
//        }
//        if (z < y && z < t){
//            System.out.println(z);
//        }else {
//            System.out.println(t);
//        }

/*
        Создать массив типа String с размером 7.
        Записать в него значения дней недели.
        Вывести на консоль значение последнего элемента.
        Смотрите решение задачи в видео.

         String [] str = {"erkushabti", "ereqshabto", "choreqshabti","hingshabti", "urbat", "shabat", "kiraki"};
        System.out.print(str[6]);
        System.out.println(str.length-1);


 */
        /*
        Создать массив типа double с размером 4.
        Записать в него любые значения с помощью блока для инициализации.
        Вывести на консоль значение первого элемента.
         */

        double[] doubles = new double[4];
        Random random = new Random(100);







    }
}
