
//  Frontend - ( визуальная сторона );

//  Backend – ( все, что под капотом );

//  byte - ( Целочисленные );

//  short - ( Целочисленные );

//  int - ( Целочисленные );

//  long - ( Целочисленные );

//  float - ( Вещественные );
//                               }  ( Amboxjakan );
//  double - ( Вещественные );

//  char - ( Символы );

//  boolean - (Логические);
//    == сравнивает два операнда на равенство                   !  -  NOT ,   НЕ
//    != сравнивает два операнда на неравенство                 &  -  AND ,   И     +  +  =  +
//    < меньше чем                                              ^  -  OR  ,   ИЛИ   +  -  =  +
//    > больше чем                                              |  -  XOR ,   ИЛИ   +  -  =  +
//    <= меньше или равно                                       && -   И  ,    И
//    >= больше или равно                                       || -  ИЛИ ,    ИЛИ

//  String - ( работы со строками );

//  1 Байт = 8 Битам


//                           *            *                   *
//                   Некоторый методы класса String для работы со строками
//
//  length(): возвращает длину строки
//  substring(): возвращает подстроку, начиная с определенного индекса до конца или до определенного индекса
//  toLowerCase(): переводит все символы строки в нижний регистр
//  toUpperCase(): переводит все символы строки в верхний регистр
//  valueOf(): преобразует объект в строковый вид
//  charAt(): возвращает символ строки по индексу
//  regionMatches(): сравнивает подстроки в строках
//  indexOf(): находит индекс первого вхождения подстроки в строку
//  lastIndexOf(): находит индекс последнего вхождения подстроки в строку
//  replace(): заменяет в строке одну подстроку на другую
//  toCharArray(): можно обратно преобразовать строку в массив символов
//  isEmpty(): (boolean) является ли строка пустой
//  equals(): сравнивает строки с учетом регистра
//  equalsIgnoreCase(): сравнивает строки без учета регистра
//  сompareTo(): сравнивает две строки
//  startsWith(): определяет, начинается ли строка с подстроки
//  endsWith(): определяет, заканчивается ли строка на определенную подстроку
//  getChars(): возвращает группу символов
//  trim(): удаляет начальные и конечные пробелы
//  concat(): объединяет строки
//  join(): соединяет строки с учетом разделителя
//
//  if (условие) {блок кода}
//  else {блок кода}
//
//  switch -  позволяет сравнивать переменную как с одним, так и с несколькими значениями
//    switch(ВыражениеДляВыбора) {               byte, short, char, int.
//     case значение1:                           Их обёртки Byte, Short, Character, Integer.
//     Блок кода 1                                          String (начиная с Java 7).
//     break;
//     default :
//     Блок кода для default
//       }
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//









